# GetTargetRebarConstraintType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetTargetRebarConstraintType Method
RebarConstraint Class See Also
---
Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.' Rebar must be Shape Driven Rebar element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TargetRebarConstraintType GetTargetRebarConstraintType()
```

Visual Basic
---
```text
Public Function GetTargetRebarConstraintType As TargetRebarConstraintType
```

Visual C++
---
```text
public:
TargetRebarConstraintType GetTargetRebarConstraintType()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.' -or- Constrained rebar is a free form rebar element. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace